{"0": 1, "21": 2, "8": 3, "4": 4, "22": 5, "271": 6, "87": 7, "44": 8, "2": 9, "69": 10, "20": 11, "94": 12, "223": 13, "392": 14, "116": 15, "162": 16, "24": 17, "26": 18, "146": 19, "320": 20, "76": 21, "205": 22, "341": 23, "184": 24, "220": 25, "459": 26, "151": 27, "84": 28, "434": 29, "93": 30, "412": 31, "259": 32, "413": 33, "122": 34, "304": 35, "385": 36, "222": 37, "71": 38, "539": 39, "318": 40, "112": 41, "88": 42, "182": 43, "462": 44, "48": 45, "215": 46, "70": 47, "32": 48, "502": 49, "95": 50, "90": 51, "397": 52, "611": 53, "108": 54, "142": 55, "386": 56, "119": 57, "23": 58, "39": 59, "568": 60, "140": 61, "261": 62, "177": 63, "453": 64, "562": 65, "565": 66, "431": 67, "237": 68, "200": 69, "214": 70, "308": 71, "204": 72, "311": 73, "323": 74, "351": 75, "186": 76, "267": 77, "296": 78, "55": 79, "248": 80, "209": 81, "195": 82, "7": 83, "328": 84, "45": 85, "544": 86, "185": 87, "86": 88, "390": 89, "435": 90, "507": 91, "289": 92, "212": 93, "225": 94, "558": 95, "35": 96, "487": 97, "409": 98, "121": 99, "484": 100, "559": 101, "364": 102, "153": 103, "491": 104, "120": 105, "303": 106, "404": 107, "391": 108, "68": 109, "227": 110, "126": 111, "149": 112, "415": 113, "43": 114, "107": 115, "14": 116, "358": 117, "165": 118, "256": 119, "315": 120, "208": 121, "133": 122, "597": 123, "143": 124, "118": 125, "388": 126, "150": 127, "46": 128, "130": 129, "168": 130, "420": 131, "230": 132, "522": 133, "536": 134, "190": 135, "77": 136, "97": 137, "102": 138, "334": 139, "546": 140, "79": 141, "531": 142, "560": 143, "333": 144, "6": 145, "582": 146, "189": 147, "167": 148, "103": 149, "285": 150, "194": 151, "508": 152, "620": 153, "396": 154, "183": 155, "217": 156, "226": 157, "247": 158, "5": 159, "100": 160, "395": 161, "286": 162, "127": 163, "216": 164, "111": 165, "384": 166, "41": 167, "191": 168, "105": 169, "605": 170, "567": 171, "31": 172, "147": 173, "246": 174, "500": 175, "252": 176, "456": 177, "401": 178, "124": 179, "550": 180, "47": 181, "203": 182, "229": 183, "270": 184, "336": 185, "175": 186, "224": 187, "98": 188, "450": 189, "548": 190, "109": 191, "233": 192, "339": 193, "56": 194, "125": 195, "563": 196, "537": 197, "231": 198, "278": 199, "488": 200, "295": 201, "430": 202, "518": 203, "542": 204, "25": 205, "42": 206, "192": 207, "291": 208, "260": 209, "117": 210, "83": 211, "272": 212, "202": 213, "1": 214, "581": 215, "410": 216, "91": 217, "372": 218, "306": 219, "64": 220, "489": 221, "596": 222, "141": 223, "482": 224, "458": 225, "78": 226, "180": 227, "592": 228, "455": 229, "374": 230, "181": 231, "526": 232, "332": 233, "305": 234, "529": 235, "297": 236, "340": 237, "493": 238, "293": 239, "104": 240, "218": 241, "557": 242, "219": 243, "281": 244, "360": 245, "383": 246, "463": 247, "480": 248, "317": 249, "590": 250, "604": 251, "437": 252, "628": 253, "344": 254, "579": 255, "15": 256, "379": 257, "439": 258, "343": 259, "357": 260, "10": 261, "503": 262, "616": 263, "187": 264, "352": 265, "61": 266, "483": 267, "479": 268, "535": 269, "426": 270, "411": 271, "163": 272, "17": 273, "110": 274, "174": 275, "314": 276, "423": 277, "626": 278, "232": 279, "27": 280, "62": 281, "538": 282, "275": 283, "253": 284, "51": 285, "608": 286, "238": 287, "419": 288, "92": 289, "115": 290, "74": 291, "551": 292, "382": 293, "433": 294, "160": 295, "615": 296, "400": 297, "353": 298, "524": 299, "609": 300, "393": 301, "99": 302, "530": 303, "461": 304, "417": 305, "188": 306, "506": 307, "402": 308, "533": 309, "545": 310, "547": 311, "514": 312, "515": 313, "598": 314, "599": 315, "406": 316, "159": 317, "577": 318, "464": 319, "429": 320, "148": 321, "523": 322, "403": 323, "470": 324, "132": 325, "478": 326, "50": 327, "639": 328, "228": 329, "276": 330, "135": 331, "583": 332, "376": 333, "580": 334, "312": 335, "578": 336, "249": 337, "173": 338, "465": 339, "60": 340, "206": 341, "157": 342, "179": 343, "199": 344, "19": 345, "387": 346, "301": 347, "586": 348, "319": 349, "72": 350, "80": 351, "321": 352, "243": 353, "566": 354, "288": 355, "12": 356, "416": 357, "572": 358, "40": 359, "284": 360, "623": 361, "36": 362, "359": 363, "632": 364, "370": 365, "346": 366, "399": 367, "193": 368, "89": 369, "287": 370, "255": 371, "245": 372, "161": 373, "607": 374, "365": 375, "176": 376, "322": 377, "532": 378, "377": 379, "389": 380, "564": 381, "588": 382, "310": 383, "316": 384, "348": 385, "198": 386, "521": 387, "367": 388, "34": 389, "52": 390, "335": 391, "273": 392, "158": 393, "134": 394, "73": 395, "477": 396, "345": 397, "101": 398, "647": 399, "164": 400, "570": 401, "378": 402, "445": 403, "436": 404, "30": 405, "618": 406, "239": 407, "221": 408, "11": 409, "152": 410, "29": 411, "65": 412, "629": 413, "269": 414, "136": 415, "634": 416, "251": 417, "606": 418, "645": 419, "361": 420, "505": 421, "454": 422, "262": 423, "81": 424, "324": 425, "368": 426, "207": 427, "258": 428, "595": 429, "496": 430, "236": 431, "617": 432, "257": 433, "540": 434, "66": 435, "244": 436, "13": 437, "601": 438, "59": 439, "309": 440, "268": 441, "424": 442, "96": 443, "649": 444, "63": 445, "137": 446, "53": 447, "561": 448, "636": 449, "144": 450, "266": 451, "294": 452, "9": 453, "471": 454, "585": 455, "452": 456, "37": 457, "460": 458, "630": 459, "129": 460, "349": 461, "469": 462, "414": 463, "380": 464, "356": 465, "347": 466, "516": 467, "235": 468, "475": 469, "355": 470, "313": 471, "381": 472, "448": 473, "254": 474, "457": 475, "38": 476, "178": 477, "635": 478, "28": 479, "495": 480, "587": 481, "280": 482, "371": 483, "263": 484, "282": 485, "213": 486, "350": 487, "57": 488, "75": 489, "494": 490, "196": 491, "625": 492, "543": 493, "250": 494, "299": 495, "394": 496, "342": 497, "373": 498, "520": 499, "16": 500, "298": 501, "432": 502, "201": 503, "171": 504, "528": 505, "451": 506, "593": 507, "398": 508, "573": 509, "131": 510, "366": 511, "422": 512, "492": 513, "622": 514, "18": 515, "362": 516, "485": 517, "241": 518, "474": 519, "128": 520, "166": 521, "513": 522, "58": 523, "591": 524, "369": 525, "114": 526, "292": 527, "338": 528, "54": 529, "612": 530, "106": 531, "549": 532, "408": 533, "274": 534, "554": 535, "169": 536, "575": 537, "327": 538, "145": 539, "210": 540, "553": 541, "172": 542, "594": 543, "326": 544, "82": 545, "3": 546, "330": 547, "363": 548, "154": 549, "552": 550, "490": 551, "468": 552, "49": 553, "443": 554, "444": 555, "290": 556, "638": 557, "375": 558, "113": 559, "279": 560, "466": 561, "242": 562, "264": 563, "584": 564, "438": 565, "473": 566, "541": 567, "138": 568, "155": 569, "569": 570, "614": 571, "510": 572, "337": 573, "307": 574, "504": 575, "501": 576, "631": 577, "331": 578, "467": 579, "621": 580, "283": 581, "511": 582, "574": 583, "441": 584, "527": 585, "85": 586, "476": 587, "123": 588, "447": 589, "499": 590, "642": 591, "481": 592, "637": 593, "407": 594, "497": 595, "240": 596, "418": 597, "498": 598, "486": 599, "156": 600, "555": 601, "300": 602, "325": 603, "589": 604, "197": 605, "302": 606, "600": 607, "640": 608, "556": 609, "472": 610, "519": 611, "234": 612, "613": 613, "277": 614, "405": 615, "512": 616, "425": 617, "139": 618, "602": 619, "446": 620, "534": 621, "211": 622, "603": 623, "170": 624, "33": 625, "571": 626, "641": 627, "610": 628, "442": 629, "644": 630, "525": 631, "646": 632, "421": 633, "329": 634, "576": 635, "354": 636, "627": 637, "427": 638, "648": 639, "650": 640, "449": 641, "619": 642, "517": 643, "509": 644, "440": 645, "624": 646, "265": 647, "67": 648, "428": 649, "643": 650, "633": 651, "651": 652, "<s>": 653}